{
	"portfolio.banner.cardSubtitle": "Software & fullstack developer",
	"portfolio.banner.cardTitle": "Graduated engineer 2023",
	"portfolio.experiences.descriptions.emmaus": "As part of my studies, I completed a two-week internship at Emmaüs Rennes. There I learned how to manage a store and sell products. This internship helped me a lot to improve on the human and relational side.",
	"portfolio.experiences.descriptions.infoClub": "During my second year at ISEN Rennes, I took the reins of the info club. I had the opportunity to organize lan, support courses for the first years and even events. During this year, I developed myself on the human aspect but also on the technical side by launching projects.",
	"portfolio.experiences.descriptions.sopra": "I completed my end-of-study work-study program at Sopra Steria. I worked as a programming engineer on different projects. From scoping to delivery, including design, development and qualification, my job was to bring projects to fruition.",
	"portfolio.experiences.descriptions.vietnam": "I spent two months in Vietnam at the end of 2023, where I joined a Vietnamese Digital Services Company. During this period, I worked on an online ticket reservation project.",
	"portfolio.experiences.titles.emmaus": "Volunteer internship at Emmaüs",
	"portfolio.experiences.titles.infoClub": "President of the computer science club",
	"portfolio.experiences.titles.sopra": "Apprenticeship at Sopra Steria",
	"portfolio.experiences.titles.vietnam": "Internship in Vietnam",
	"portfolio.footerDesc": "Made in Angular by Valentin Moizan",
	"portfolio.formation.capgemini": "Full-time position at Capgemini (internal project)",
	"portfolio.formation.baccalaureate": "Scientific Baccalaureate",
	"portfolio.formation.emmaus": "Volunteer internship at Emmaüs",
	"portfolio.formation.isen": "ISEN engineering school, software engineering field",
	"portfolio.formation.orange": "Internship at Orange",
	"portfolio.formation.sopraApprenticeship": "Apprenticeship at Sopra Steria",
	"portfolio.formation.sopraInternship": "Internship at Sopra Steria",
	"portfolio.formation.summer2019": "Summer 2019",
	"portfolio.formation.summer2022": "Summer 2022",
	"portfolio.heading": "Portfolio of Valentin Moizan",
	"portfolio.presentation.downloadResume": "Download my resume",
	"portfolio.presentation.text": "As an ISEN graduate engineer, I've been passionate about computer science since my teenage years. Self-taught in Java programming from the age of 15, I have acquired strong skills in software and fullstack development. My background combines academic training, professional experiences at Capgemini and Sopra Steria, and personal projects, allowing me to have both a theoretical and practical approach to software development.",
	"portfolio.projects.descriptions.abmuCarrefour": "ABMU-Carrefour is an ISEN M1 project. Its purpose is to generate a road junction simulation using Unity software and the ABMU framework. The technology used is multi-agent simulation. The agents (cars and pedestrians) must respect the traffic laws. Some \"rogue\" agents don't, and can sometimes cause accidents.",
	"portfolio.projects.descriptions.apiSpring": "As part of my 5th year courses on the Java Spring Boot framework at ISEN, I was asked to develop an API. This API was used in a banking context, with advisors, customers etc...",
	"portfolio.projects.descriptions.arcadeTerminal": "With two classmates and the financial support of the computer science club, we set about creating an arcade terminal from scratch, to be installed on the ISEN Rennes premises. The physical side of the project was quickly completed, but the IT side took some time.  We had to develop a main menu for the terminal that could handle all the games on it. The aim was to enable future students to code and easily add games to the terminal.",
	"portfolio.projects.descriptions.hmiConnectivity": "I've developed a connectivity interface that can display and modify the connections of a network of nodes. This interface is developed in Angular and displays connectivity links between nodes in the form of a two-entry table. The GUI also features a spring boot server in the back, enabling information to be transmitted between the front end and the service.",
	"portfolio.projects.descriptions.isenPlatform": "As part of my studies, I created a software program for platform games. The difficulty of this project was that we were starting from scratch. The environment had to be created  (e.g. gravity, collisions). Finally, to make the game accessible, I set up an installer. Simply download and run it to install the game on your computer.",
	"portfolio.projects.descriptions.morIsen": "I've developed an android application that lets you play tic-tac-toe against other users. The database is stored on firebase and allows the application to manage several games simultaneously. Players can register with their phone number and create an account with it. A win-loss ratio is then linked to the account.",
	"portfolio.projects.descriptions.portfolio": "I developed my online portfolio in Angular (https://moizan-valentin.web.app). The site can be easily updated thanks to Angular and its component system. My website is available as open source: https://github.com/val-moizan/my-portfolio. In addition, the application sets up automatic deployment using the github workflow. It is automatically deployed on Firebase when pushing to the main branch.",
	"portfolio.projects.descriptions.sigma": "Sigma production was an organization created by a friend and me. We embarked on an adventure which aimed to develop and put online an improvement of the Minecraft game. This experience allowed me to discover a lot of things in Java and to manage a community. This community was built around the Sigma software and our team was made up of 5 members. Every day, more than 6000 unique users visited our website. Among these visitors, 4000 downloaded our software.",
	"portfolio.projects.descriptions.tda": "At Capgemini, I joined the TDA (Topological Data Analysis) project as a developer. Our mission: to create from scratch a web application mapping topological electricity data in France and their predictions. As the lead of a team of 3-4 developers, I worked on the project using Agile methodology with 2-week sprints, combining teamwork and technical development.",
	"portfolio.projects.role.developer": "Developer",
	"portfolio.projects.role.leadDeveloper": "Lead-Developer",
	"portfolio.projects.role.president": "President",
	"portfolio.projects.role.projectManager": "Project manager",
	"portfolio.projects.role.role": "Role",
	"portfolio.projects.scope.associative": "Associative",
	"portfolio.projects.scope.personnal": "Personal",
	"portfolio.projects.scope.professional": "Professional",
	"portfolio.projects.scope.scope": "Scope",
	"portfolio.projects.smallDescriptions.abmuCarrefour": "Development of a 3D environment under Unity",
	"portfolio.projects.smallDescriptions.apiSpring": "Developing a spring boot API",
	"portfolio.projects.smallDescriptions.arcadeTerminal": "Construction and development of an arcade terminal",
	"portfolio.projects.smallDescriptions.hmiConnectivity": "Fullstack development of an Angular GUI, a Spring Boot server, and a service in Java",
	"portfolio.projects.smallDescriptions.isenPlatform": "Development of a 2D platform game",
	"portfolio.projects.smallDescriptions.morIsen": "Development of a tic tac toe game on an android application",
	"portfolio.projects.smallDescriptions.portfolio": "Development and deployment of my online portfolio",
	"portfolio.projects.smallDescriptions.sigma": "Development of an improvement to the Minecraft game. Managing a community",
	"portfolio.projects.smallDescriptions.tda": "Development of a topological data analysis web application",
	"portfolio.projects.team": "Team",
	"portfolio.projects.technologie": "Technologie",
	"portfolio.projects.titles.arcadeTerminal": "Arcade terminal",
	"portfolio.projects.titles.connectivityHMI": "HMI connectivity",
	"portfolio.skills.boxTitles.database": "Data base",
	"portfolio.skills.boxTitles.devTools": "Development tools",
	"portfolio.skills.boxTitles.graphicTools": "Graphics tools",
	"portfolio.skills.boxTitles.languages": "Languages",
	"portfolio.skills.boxTitles.softwareDev": "Software Development",
	"portfolio.skills.boxTitles.webDev": "Web development",
	"portfolio.skills.language.english": "English",
	"portfolio.skills.language.french": "French",
	"portfolio.skills.language.german": "German",
	"portfolio.titleExperiences": "Experiences",
	"portfolio.titleFormation": "Education",
	"portfolio.titlePresentation": "Presentation",
	"portfolio.titleProjects": "Projects",
	"portfolio.titleSkills": "Skills"
}
