{
	"portfolio.banner.cardSubtitle": "Développeur logiciel & full stack",
	"portfolio.banner.cardTitle": "Ingénieur diplômé 2023",
	"portfolio.experiences.descriptions.emmaus": "Dans le cadre de mes études, j'ai réalisé un stage de deux semaines à Emmaüs Rennes. J'y ai appris à gérer une boutique et à vendre des produits. Ce stage m'a beaucoup aidé à m'améliorer sur le côté humain et relationnel.",
	"portfolio.experiences.descriptions.infoClub": "Pendant ma deuxième année à l'ISEN Rennes, j'ai pris les rênes du club info. J'ai eu l'occasion d'organiser des lan, des cours de soutien pour les premières années ou encore des évênements. Durant cette année, je me suis développé sur l'aspect humain mais aussi technique en lançant des projets.",
	"portfolio.experiences.descriptions.sopra": "J'ai réalisé mon alternance de fin d'étude chez Sopra Steria. J'intervenais en tant qu'ingénieur programmeur sur différents projets. Du cadrage à la livraison en passant par la conception, le développement ainsi que la qualication, mon travail était de mener des projets à terme.",
	"portfolio.experiences.descriptions.vietnam": "Je vais réaliser un stage au vietnam sur la période septembre-novembre 2023.",
	"portfolio.experiences.titles.emmaus": "Stage bénévole à Emmaüs",
	"portfolio.experiences.titles.infoClub": "Président du club info",
	"portfolio.experiences.titles.sopra": "Alternance chez Sopra Steria",
	"portfolio.experiences.titles.vietnam": "Stage au vietnam",
	"portfolio.footerDesc": "Fait en Angular par Valentin Moizan",
	"portfolio.formation.baccalaureate": "Baccalauréat scientifique",
	"portfolio.formation.emmaus": "Stage bénévole à Emmaüs",
	"portfolio.formation.isen": "École d'ingénieur ISEN, domaine du génie logiciel",
	"portfolio.formation.orange": "Stage de 3ème chez Orange",
	"portfolio.formation.sopraApprenticeship": "Alternance chez Sopra Steria",
	"portfolio.formation.sopraInternship": "Stage chez Sopra Steria",
	"portfolio.formation.summer2019": "Été 2019",
	"portfolio.formation.summer2022": "Été 2022",
	"portfolio.heading": "Portfolio de Valentin Moizan",
	"portfolio.presentation.downloadResume": "Télécharger mon CV",
	"portfolio.presentation.text": "Je m’appelle Valentin Moizan et je suis en 5 ème année à l’ISEN de Brest. Dès le collège, j'ai été passioné par l'informatique et les jeux vidéos. J'ai appris à développer en java dès le lycée en autodidacte. J'ai eu l'occasion de mener de nombreux projets pendant mon temps personnel et au cours de ma formation. Mon intérêt dans ce domaine s’est focalisé sur le développement logiciel ainsi que le développement de jeux vidéos.",
	"portfolio.projects.descriptions.abmuCarrefour": "ABMU-Carrefour est un projet réalisé dans le cadre du projet M1 à l'ISEN. Il a pour but de générer une simulation de carrefour routier avec le logiciel Unity et le framework ABMU. La technologie mise en avant est la simulation multi agents. Les agents (voitures et piétons) doivent réspecter le code de la route. Certains agents \"voyous\" ne le respectent pas, et peuvent alors parfois provoquer des accidents.",
	"portfolio.projects.descriptions.apiSpring": "Dans le cadre des cours sur le framework Java Spring Boot en 5ème année à l'ISEN, j'ai été amené à développer une API. Cette API était utilisée dans un contexte banquaire, avec des conseillers, des clients etc..",
	"portfolio.projects.descriptions.arcadeTerminal": "Avec deux camarades de classe ainsi que l'aide financière du Club Info, nous nous sommes lancés dans l'idée de créer de toutes pièces une borne d'arcade qui serait installée dans les locaux de l'ISEN Rennes. Le côté physique a été rapidement terminé mais le support informatique a pris du temps.  Nous devions développer un menu principal de la borne qui puisse prendre en compte tous les jeux de celle-ci. Le but était que les futurs étudiants puissent coder et ajouter des jeux à leur guise sur la borne.",
	"portfolio.projects.descriptions.hmiConnectivity": "J'ai développé une interface de connectivité qui permet d'afficher et de modifier les connexions d'un réseau de noeuds. Cette interface est développée en angular et affiche les liens de connectivité entre les noeuds sous la forme d'un tableau à deux entrées. L'IHM comporte aussi un serveur spring boot en back qui permet de transmettre les informations entre le front et le service.",
	"portfolio.projects.descriptions.isenPlatform": "Dans le cadre de mes études, j'ai été amené à créer un logiciel de jeux de plateforme. La difficulté de ce projet était le fait que l'on partait de rien. L'environnement a dû être créé de toute pièce (ex: la gravité, les collisions). Enfin, afin de rendre accessible le jeu, j'ai mis en place un installer. Il suffit de le télécharger et de le lancer pour installer le jeu sur votre ordinateur.",
	"portfolio.projects.descriptions.morIsen": "J'ai développé une application android qui permet de jouer au morpion contre d'autres utilisateurs. La base de données est stockée sur firebase et permet à l'application de gérer simultanément plusieurs partie. Un joueur peut s'inscrire avec son numéro de téléphone et créer un compte avec ce dernier. Un ratio de victoires - défaites est alors lié à son compte.",
	"portfolio.projects.descriptions.portfolio": "J'ai développé mon portfolio en ligne en Angular (https://moizan-valentin.web.app). Le site peut-être facilement mis à jour grâce à Angular et son systeme de component. Mon site web est disponible en open source : https://github.com/val-moizan/my-portfolio. De plus, l'application met en place un déploiement automatique grâce au github workflow. Elle est automatiquement déployée sur firebase lors d'un push sur la branche main.",
	"portfolio.projects.descriptions.sigma": "Sigma production était une organisation créée par un ami et moi. On s'est lancé dans une aventure qui avait pour but de développer et mettre en ligne une amélioration du jeu Minecraft. Cette expérience m'a permis de découvrir énormément de choses en Java et de gérer une communauté. Cette communauté s'est bâtie autour du logiciel Sigma et notre équipe était constituée de 5 membres. Chaque jours, plus de 6000 utilisateurs uniques visitaient notre site internet. Parmis ces visiteurs, 4000 téléchargaient notre logiciel.",
	"portfolio.projects.role.developer": "Développeur",
	"portfolio.projects.role.president": "Président",
	"portfolio.projects.role.projectManager": "Chef de projet",
	"portfolio.projects.role.role": "Rôle",
	"portfolio.projects.scope.associative": "Associatif",
	"portfolio.projects.scope.personnal": "Personnel",
	"portfolio.projects.scope.professional": "Professionel",
	"portfolio.projects.scope.scope": "Cadre",
	"portfolio.projects.smallDescriptions.abmuCarrefour": "Développement d'un environnement 3D sous unity",
	"portfolio.projects.smallDescriptions.apiSpring": "Développement d'une API spring boot",
	"portfolio.projects.smallDescriptions.arcadeTerminal": "Construction et développement d'une borne d'arcade",
	"portfolio.projects.smallDescriptions.hmiConnectivity": "Développement fullstack d'une IHM Angular, d'un serveur Spring Boot, et d'un service en Java",
	"portfolio.projects.smallDescriptions.isenPlatform": "Développement d'un jeux type platform 2D",
	"portfolio.projects.smallDescriptions.morIsen": "Développement d'un jeu morpion sur une application android",
	"portfolio.projects.smallDescriptions.portfolio": "Développement et déploiement de mon portfolio en ligne",
	"portfolio.projects.smallDescriptions.sigma": "Développement d'une amélioration du jeu Minecraft. Gestion d'une communauté",
	"portfolio.projects.team": "Équipe",
	"portfolio.projects.technologie": "Technologie",
	"portfolio.projects.titles.arcadeTerminal": "Borne d'arcade",
	"portfolio.projects.titles.connectivityHMI": "IHM de connectivité",
	"portfolio.skills.boxTitles.database": "Bases de données",
	"portfolio.skills.boxTitles.devTools": "Outils de développement",
	"portfolio.skills.boxTitles.graphicTools": "Outils de graphisme",
	"portfolio.skills.boxTitles.languages": "Langues",
	"portfolio.skills.boxTitles.softwareDev": "Développement logiciel",
	"portfolio.skills.boxTitles.webDev": "Dévelopement web",
	"portfolio.skills.language.english": "Anglais",
	"portfolio.skills.language.french": "Français",
	"portfolio.skills.language.german": "Allemand",
	"portfolio.titleExperiences": "Expériences",
	"portfolio.titleFormation": "Formation",
	"portfolio.titlePresentation": "Présentation",
	"portfolio.titleProjects": "Projets",
	"portfolio.titleSkills": "Compétences"
}
